public class JumpStatements {

    /*

    - Jump Statements-ები არის: Break, Continue, Return;

    -  Break გამოიყენება რომ შეაჩეროს loop, მაგრამ იგი მოქმედებს ჩადგმული ლუპების შემთხვევაში იმ სკოუპში სადაც ჩადგმულია
        და გავლენას არ ახდენს გარე ლუპებზე, როგორც switch-ში ჩასმული break იმოქმედებს უშუალოდ იმ ქეისზე სადაც იგია
        მოთავსებული და არ გამოიწვევს გარე ლუპის შეწყვეტას, ან პროგრამის გაჩერებას.

    - return არის jump statement,რომლის ერთადერთი დანიშნულებაა method-ის (ჩვენს შემთხვევაში main method-ის)
      დაუყოვნებლივ შეწყვეტა და პროგრამის კონტროლის დაბრუნება იმისთვის, ვინც ეს method გამოიძახა
      (ანუ მის caller-ისთვის).

    - main method-ში return ბრძანების გამოყენება ნიშნავს "დაასრულე პროგრამა ახლავე და დაუბრუნდი
    კონტროლი run-time system-ს".

    - ქვემოთ ეს ხაზი: "if (t)return;" if-ის გარეშე კომპილაციის ერორს მოგვცემდა, რადგან return უპირობო დასრულებას ნიშნავს
      და მის შემდეგ არაფერი არ შესრულდეება, ხოლო როცა სადემონსტრაციოდ if დავუწერეთ, კომპილატორი ფიქრობს რომ return
      დამოკიდებულია if (t)-ზე, და დაშვებას აკეთებს რომ თუ if (t) = false, return აღარ შესრულდება.
         */
    public static void main(String[] args) {
        boolean t =true;
        System.out.println("before return");
        if (t)return;
        System.out.println("this won't  ");
    }
}
